Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE.tmx
Source language: de_ch
Languages: en_gb

source: Strukturierung von Informationseinheiten:
en_gb: Structuring information units:

source: Segmentieren, Komprimieren, Paraphrasieren
en_gb: segmenting, compressing, paraphrasing

source: Antizipations-, Inferenz- und Krisenstrategien
en_gb: anticipation, inference and crisis strategies

source: Output-Kontrolle
en_gb: Output control

source: Je nach Verfügbarkeit der Dozierenden
en_gb: Depending on availability of teaching staff

source: Ausgangs- und Zielsprache
en_gb: Source and target language

source: Standortgespräch in Form einer schriftlichen Leistungsbeurteilung während des Semesters.
en_gb: Status review in the form of a written assessment in the course of the semester.

source: Konsekutivdolmetschen I (B/C-A)
en_gb: Consecutive Interpreting I (B/C-A)

source: Ausgangs- und Zielsprache (variiert je nach der Sprachkombination der Studierenden)
en_gb: Source and target language (varies according to students’ language combination)

source: Konsekutivdolmetschen I (A-B)
en_gb: Consecutive interpreting I (A-B)

source: siehe „Lerninhalte“
en_gb: see “Course content”

source: Vermittlung der grundlegenden Strategien des Konsekutivdolmetschens anhand von unterschiedlichen Textsorten, -registern mit zunehmendem Schwierigkeitsgrad (leicht bis mittelschwer) zu aktuellen internationalen Themen
en_gb: Key strategies in consecutive interpreting are acquired from a range of text types on current international topics with registers of increasing difficulty (easy to relatively difficult)

source: Vermittlung von Strategien zur inhaltlich strukturierten und sprachlich korrekten mündlichen Wiedergabe von längeren Texten unterschiedlichen Schwierigkeitsgrads (Struktur, Syntax, Lexik, Thema, Vortragsgeschwindigkeit)
en_gb: Strategies for orally reproducing the content of longer texts of varying degrees of difficulty (correct structure, syntax, lexis, topic, speed of presentation)

source: Vertiefung/Verfeinerung Notationssystem
en_gb: Advanced note-taking skills

source: Konsekutivdolmetschen II (A–B)
en_gb: Consecutive interpreting II (A-B)

source: Vermittlung der grundlegenden Strategien des Konsekutivdolmetschens anhand von unterschiedlichen Textsorten, -registern mit zunehmendem Schwierigkeitsgrad (leicht bis mittelschwer) zu aktuellen internationalen Themen:
en_gb: Key strategies in consecutive interpreting are acquired from a range of text types on current international topics with registers of increasing difficulty (easy to relatively difficult)

source: siehe "Lerninhalte"
en_gb: see “Course content”

source: Konsekutivdolmetschen III (A-B)
en_gb: Consecutive interpreting III (A-B)

source: kommunizieren mit dem Publikum, sind als Dolmetschpersönlichkeit spürbar.
en_gb: communicate with the public, have a clear role as interpreter

source: erreichen in diesem Semester die Marktreife.
en_gb: are ready to enter the market following this semester

source: wissen, was von Ihnen bei der Modulendprüfung in Konsekutivdolmetschen verlangt wird und sind in der Lage, diese Leistung zu erbringen.
en_gb: know what is demanded of them in the end-of-module examinations in consecutive interpreting and are able to produce these skills.

source: sind in der Lage, anspruchsvolle allgemeinsprachliche Reden vollständig zu notieren und sachlich und sprachlich korrekt wiederzugeben.
en_gb: are able to take comprehensive notes on longer speeches on general topics and to reproduce these correctly, maintaining linguistic accuracy

source: sind in der Lage, fachsprachliche Reden vollständig zu notieren und sachlich und sprachlich korrekt wiederzugeben.
en_gb: are able to take comprehensive notes on longer speeches on specialist topics and to reproduce these correctly, maintaining linguistic accuracy

source: tragen die Konsekutive zügig und flüssig vor.
en_gb: deliver a consecutive interpretation rapidly and fluently.

source: Vermittlung der fortgeschrittenen Strategien des Konsekutivdolmetschens anhand von unterschiedlichen Textsorten, -registern mit zunehmendem Schwierigkeitsgrad (leicht bis mittelschwer) zu aktuellen nationalen und internationalen Themen
en_gb: Advanced strategies in consecutive interpreting are acquired from a range of text types on current national and international topics with registers of increasing difficulty (easy to relatively difficult)

source: Aufmerksamkeit auf einer angenehmen, ruhigen und überzeugenden Präsentation
en_gb: Attention is paid to producing a pleasant, calm and convincing presentation

source: Weitere Optimierung von Wortschatz, Idiomatik und Register
en_gb: Further improvement of vocabulary, idiom and register

source: Übung
en_gb: Exercises

source: Mündliche Prüfung auf Kursebene gemäss separaten Ausführungsbestimmungen.
en_gb: Oral examination at course level according to separate implementing provisions.

source: Note in Viertelnotenschritten.
en_gb: Marks in increments of 1/4.

source: Übung, zeitliche Aufteilung:
en_gb: Exercises, time allocation :

source: Konsekutivdolmetschen III (B/C-A)
en_gb: Consecutive Interpreting III (B/C-A)

source: Grundkenntnisse der Geschichte der Rhetorik
en_gb: General knowledge of the history of rhetoric

source: Kenntnisse unterschiedlicher Redetypen
en_gb: Understanding of the different types of rhetorical speech

source: Fähigkeit, rednerische Muster und Strategien zu erkennen
en_gb: Ability to recognise rhetorical patterns and strategies

source: Kenntnisse der rhetorischen Stilmittel
en_gb: Understanding of modern rhetorical devices

source: Fähigkeit, rhetorische Stilmittel der gegenwärtigen Alltagsrhetorik anzuwenden
en_gb: Ability to use modern rhetorical devices

source: Fähigkeit zur verbal, nonverbal und paraverbal einheitlichen Gestaltung von Reden
en_gb: Ability to give speeches paying attention to verbal, non-verbal and para-verbal aspects

source: Erfahrungen mit dem Auftreten als Redepersönlich-keit
en_gb: Ability to speak comfortable in front of others

source: Persönliche Eigenarten, Stärken und Schwächen kennen und damit umgehen können
en_gb: Awareness of personal characteristics, strengths and weakness and ability to deal with them

source: Einführung in die Rhetorik:
en_gb: Introduction to Rhetoric:

source: Geschichte (Antike bis Neuzeit)
en_gb: History (Antiquity to modern times)

source: Analyse historischer und zeitgenössischer politischer Reden (Kontext, Aufbau, Inhalt, Strategie, Sprache)
en_gb: Analysis of the historical and contemporary political rhetoric (context, development, content, strategy, language)

source: Redetypen
en_gb: Types of rhetorical speech

source: Manipulationstechniken
en_gb: Manipulative techniques

source: Rhetorische Stilmittel
en_gb: Rhetorical devices

source: Rabulistische Oberhandstrategien
en_gb: Sophistry

source: Frei gestaltete argumentative Reden halten
en_gb: Extemporising argumentative speech

source: Audio- und Videoanalyse (verbale, nonverbale und paraverbale Kommunikation)
en_gb: Audio and video analysis (verbal, non-verbal and para-verbal communication)

source: Analyse der individuellen rednerischen und sprecherischen Fähigkeiten
en_gb: Analysis of one's own rhetorical and speaking skills

source: Bewertung während des Semesters.
en_gb: Assessment ongoing during semester.

source: Vertiefung rhetorischer Kommunikation in Theorie und Praxis
en_gb: Advanced rhetorical communication in theory and practice

source: Kulturelle Bedeutung von Anlass-/Festreden Analyse von Anlass-/Festreden
en_gb: Cultural importance of official speech-giving Analysis of official speech-giving

source: Grundkenntnisse der wesentlichen Elemente von Anlass-/Festreden
en_gb: Understanding of the key elements in speech-giving

source: Verbale, nonverbale, paraverbale Aspekte Sprechtempo, Rhythmus, Atmung, Stimme
en_gb: Verbal, non-verbal and para-verbal aspects of the speed and rhythm of delivery, of breathing and voice

source: Inhaltliches, syntaktisches, rhetorisches, rhythmisches, sprecherisches, stimmliches Nachgestalten komplexer Anlass-/Festreden
en_gb: Reproducing complex official speeches with attention to content, syntax, rhetoric, rhythm, language and voice

source: Frei gestaltete Anlass-/Festreden halten
en_gb: Extemporising official speeches

source: Audio- und Videoanalyse (verbale, nonverbale und paraverbale Aspekte, Wirkung)
en_gb: Audio and video analysis (verbal, non-verbal and para-verbal aspects; impact)

source: Beurteilung und Beratung in der rhetorischen Performanz
en_gb: Discussion and assessment of rhetorical performance

source: Simultandolmetschen I (B/C-A)
en_gb: Consecutive Interpreting I (B/C-A)

source: Simultandolmetschen II (A-B)
en_gb: Simultaneous Interpreting II (A-B)

source: lösen sich von der Unterrichtssituation und beginnen, als Dolmetschpersönlichkeit zu kommunizieren beherrschen die Grundelemente der Simultantechnik sicher
en_gb: no longer require intensive instruction and begin to develop as an independent interpreter master the key aspects of the simultaneous method

source: sind in der Lage, allgemeinsprachliche Reden und leichtere Fachtexte vollständig (langsames bis mittleres Tempo) bzw. teilweise vollständig
en_gb: are able to interpret speeches on general topics and undemanding specialist texts in full (slow to medium speed) or partially

source: (schnelleres Tempo) zu dolmetschen
en_gb: (fast)

source: Vermittlung der grundlegenden Strategien des Simultandolmetschens anhand von unterschiedlichen Textsorten, -registern mit zunehmendem Schwierigkeitsgrad (leicht bis mittelschwer) zu aktuellen internationalen Themen:
en_gb: Key strategies in simultaneous interpreting are acquired from a range of text types on current international topics with registers of increasing difficulty (easy to relatively difficult):

source: Simultandolmetschen II (B/C-A)
en_gb: Consecutive Interpreting II (B/C-A)

source: Simultandolmetschen III (A-B)
en_gb: Simultaneous Interpreting III (A-B)

source: wissen, was von Ihnen bei der Modulendprüfung in Simultandolmetschen verlangt wird und sind in der Lage, diese Leistung zu erbringen.
en_gb: know what is demanded of them in the end-of-module examinations in simultaneous interpreting and are able to produce these skills.

source: beherrschen auch fortgeschrittene Elemente der Simultantechnik sicher.
en_gb: have also mastered advanced aspects of the simultaneous method

source: sind in der Lage, Sachvorträge vollständig (langsames bis mittleres Tempo) bzw. teilweise vollständig (schnelleres Tempo) zu dolmetschen.
en_gb: are able to interpret speeches on specialist topics in full (slow to medium speed) or partially (fast)

source: sind in der Lage, ein Zielprodukt zu liefern, das sachlich und sprachlich korrekt, wendig und elegant ist.
en_gb: are able to deliver skilfully and elegantly a target product that is linguistically and factually correct

source: können mit Redevorlagen (Text) sicher umgehen.
en_gb: are able to handle speech manuscripts with confidence

source: Vermittlung der grundlegenden Strategien des Simultandolmetschens anhand von unterschiedlichen Textsorten, -registern mit zunehmendem Schwierigkeitsgrad (leicht bis mittelschwer) zu aktuellen nationalen und internationalen Themen
en_gb: Key strategies in simultaneous interpreting are acquired from a range of text types on current national and international topics with registers of increasing difficulty (easy to relatively difficult)

source: Fortgeschrittene Übungen zur Simultantechnik mit und ohne Text, mit muttersprachlichen und nicht-muttersprachlichen RednerInnen, mit und ohne Vorbereitung
en_gb: Advanced exercises in the simultaneous method with and without text, with native and non-native speakers, with and without preparation

source: Simultandolmetschen III (B/C-A)
en_gb: Simultaneous Interpreting III (B/C-A)

source: Regelmässiger Präsenzunterricht in Kleingruppen
en_gb: regular attendance in small groups

source: Lautlehre:
en_gb: Phonetics:

source: Vokal- und Konsonantensystem der gemässigten deutschen Hochlautung
en_gb: Vowel and consonant system in standard German pronunciation

source: Übungen zur Artikulation und Lautbildung
en_gb: Articulation and sound-formation

source: Lese- und (Frei-)Sprechübungen
en_gb: Reading and speaking exercises (extemporising)

source: Feedback zu sprecherischen Leistungen im Dolmetschunterricht (Audioanalysen, Unterrichtsbesuche)
en_gb: Feedback on speaking skills in interpreting modules (audio analysis, lesson attendance)

source: Regelmässiger Kontaktunterricht
en_gb: Regular class instruction

source: Ausdruckssprechen (Einheit von verbaler, nonverbaler und paraverbaler Kommunikation)
en_gb: Conveying meaning through expression (combining verbal, non-verbal and para-verbal communication)

source: Wort-(Kontrast)Übungen, Satzübungen
en_gb: Word (contrast) exercises, sentence exercises

source: Wort- und Satzakzent, prosodische Übungen
en_gb: Accentuation of words and sentences, prosody

source: verfügen über vertiefte Kenntnisse der Phonetik und Phonologie der gemässigten deutschen Hochlautung haben ihre sprecherischen Fähigkeiten, insbesondere hinsichtlich standardsprachliche Artikulation, Intonation, Prosodie optimiert
en_gb: have advanced knowledge of the phonetics and phonology of standard German pronunciation have optimised their speaking skills, in particular their standard articulation, intonation and prosody

source: verfügen über differenzierte Fähigkeiten der verbalen, nonverbalen und paraverbalen Kommunikation verfügen über Differenzierte Fähigkeiten des Ausdruckssprechens
en_gb: have differentiated skills in the verbal, non-verbal and para-verbal aspects of communication

source: praktizieren ganzheitliches, kommunikatives, intentionales, sinnbetontes professionelles Sprechen haben die Stimmresonanz weiterentwickelt
en_gb: speak coherently, communicatively, intentionally, purposefully and professionally have developed the resonance of their voice

source: Vertiefung/Erweiterung der sprachlich-sprecherischen Kenntnisse/Fähigkeiten in Theorie und Praxis
en_gb: Advanced speaking techniques/advanced theory and practice

source: Erweiterte Übungen zur Artikulation und Lautbildung (Vokale, Konsonanten)
en_gb: Further exercises in articulation and sound-formation (vowels, consonants)

source: Vertiefende prosodische Übungen
en_gb: Advanced prosody

source: Erweiterte Übungen im Ausdruckssprechen
en_gb: Advanced techniques in conveying meaning through expression

source: Einheit von verbaler, nonverbaler und paraverbaler Kommunikation
en_gb: combining verbal, non-verbal and para-verbal communication

source: Pausentechnik, Rhythmik, Sprechtempo, Atmung, Stimme
en_gb: Use of pauses, rhythm, speed of delivery, breathing and voice

source: Komplexe Übungen in deutsch-deutsch konsekutiver Wiedergabe
en_gb: Complex exercises in German-German consecutive rendering

source: Beurteilung und Beratung in der sprecherischen Performanz beim Dolmetschen (sim/kons)
en_gb: Discussion and assessment of speaking performance in interpreting

source: Erwerb umfassender Sprechkompetenzen
en_gb: Acquisition of comprehensive speaking skills

source: Übungen in deutsch-deutsch konsekutiver Wiedergabe
en_gb: German-German consecutive rendering

source: sind in der Lage, dolmetscherisch-sprecherische Dysfunktionen zu vermeiden
en_gb: are able to avoid dysfunctional speaking patterns that compromise interpreting output

source: Kommunikativ handeln:
en_gb: Acting communicatively:

source: Vertiefung FÜ ab FS 2016:
en_gb: Specialisation in Professional Translation from FS 2016:

source: Schreibkompetenz für Übersetzende (Modul und Kurs)
en_gb: Writing Skills for Translators (module and course)

source: Schreibkompetenz für Übersetzende (ACC)
en_gb: Writing Skills for Translators (ACC)

source: Schreibkompetenz
en_gb: Writing skills

source: Schreibprozess und -strategien
en_gb: Writing process and strategies

source: Textfunktion und Textkompetenz
en_gb: Text function and text skills

source: Argumentation (z.B. essayistisch-kommentierend-meinungsbetont versus sachlich-erörternd-überzeugungsorientiert)
en_gb: Argumentation (e.g. essayist-commenting-opinion versus factual-arguing-persuasive)

source: Fachlichkeitsgrad (z. B. Populärwissenschaft, Verwaltungstexte)
en_gb: Degree of specialisation (e.g. popular science, public administration texts)

source: Academic English (z. B. Abstract, Bionote)
en_gb: Academic English (e.g. abstract, bionote)

source: Seminar mit Inputs durch Dozierende; Lösung von Aufgabenstellungen in Kleingruppen; Schreibwerkstätten
en_gb: Seminar with input from teachers; exercises done in small groups; writing workshops

source: Begleitetes Selbststudium:
en_gb: Accompanied self-study:

source: Autonomes Selbststudium:
en_gb: Independent self-study:

source: 6 Blöcke à 4 Stunden
en_gb: 6 blocks of 4 hours

source: Leistungsnachweis
en_gb: Assessment

source: Benotung der 3 Arbeiten
en_gb: Assessment of three assignments

source: Portfolio (3 Arbeiten + 2 Peer-Feedbacks)
en_gb: Portfolio (3 assignments + 2x peer feedback)

source: Textgrundlagen und weiterführende Literatur werden bekannt gegeben.
en_gb: Principal texts and further reading to be announced.

source: Copywriting (z. B. Firmenporträt oder Behördenbrief)
en_gb: Copy-writing (e.g. film portrait or official letter)

source: Schreibkompetenz für Übersetzende
en_gb: Writing Skills for Translators

source: Sprachtechnologie I
en_gb: Language Technology I

source: Teilnehmende ohne Vorkenntnisse in der Verwendung von CAT-Software können selbständig ein Übersetzungsprojekt mit der marktführenden Software SDL Trados Studio bearbeiten.
en_gb: Participants without prior experience of CAT software can independently handle a translation project with the market-leading software SDL Trados Studio.

source: Teilnehmende mit Vorkenntnissen in der Verwendung von CAT-Software können selbständig ein Übersetzungsprojekt mit einer zusätzlichen noch zu benennenden CAT-Software bearbeiten.
en_gb: Participants with prior experience of CAT software can independently handle a translation project with an additional CAT tool (to be determined).

source: Teilnehmende wissen, wie ein mehrsprachiger Korpus für einen Übersetzungsauftrag erstellt wird.
en_gb: Participants know how a multi-lingual corpus is created for a translation assignment.

source: Teilnehmende können die erlangten CAT-Kenntnisse auf eine weitere CAT-Software mit ähnlicher Funktionalität anwenden.
en_gb: Participants can apply the CAT skills acquired to other CAT software programmes with similar functions.

source: Der Kurs gliedert sich in 4 Phasen.
en_gb: The course is divided into four phases.

source: Nach einer Einführung (Phase 1) erhalten die Studierenden in Phase 2 eine Übersicht über die grundlegende Struktur von CAT-Systemen.
en_gb: Following an introduction (Phase 1), in Phase 2 the students gain an overview of the basic structure of CAT systems,

source: Sie werden mit den wesentlichen CAT-basierten Prozessen und Workflows vertraut gemacht.
en_gb: their key processes and workflows.

source: Simulation realistischer Übersetzungsarbeit
en_gb: to simulate realistic translation work

source: Motivation zum Einsatz von Sprachtechnologie durch zunehmenden Fachlichkeitsgrad der Ausgangstexte
en_gb: to motivate students to use language technologies by introducing increasingly specialist source texts

source: Kooperation mit realem Auftraggeber
en_gb: to give students the opportunity to cooperate with an actual client

source: Hands-on Prüfung (Bewertungsart: bestanden/nicht bestanden)
en_gb: Hands-on examination (assessment: pass/fail)

source: Teilnehmende können Alignments erstellen, Terminologieeinträge machen und mit der jeweiligen Software übersetzen.
en_gb: Participants can create alignments, make terminological entries and translate using the software.

source: Evaluation der erstellten Korpora durch Anwendung in Phase 4 (Bewertungsart: bestanden/nicht bestanden)
en_gb: Evaluation of corpora created when applied in Phase 4 (assessment: pass/fail)

source: Bewertung des Lerntagebuchs.
en_gb: Assessment of learning journal.

source: (Bewertungsart: bestanden/nicht bestanden)
en_gb: (Assessment: pass/fail.)

source: Voraussetzung für das Bestehen des Kurses:
en_gb: Requirement for passing the course:

source: Bestehen aller Leistungsnachweise
en_gb: Pass in all phases.

source: Weitere Lektüre wird im Kurs bekannt gegeben.
en_gb: Further reading will be announced during the course.

source: Anhand eines Übersetzungsauftrags, den sie in Gruppen bearbeiten, lernen die Studierenden die wichtigsten Eigenschaften eines CAT Tools (z.B. SDL Trados Studio) kennen.
en_gb: The students become familiar with the key characteristics of a CAT tool (e.g. SDL Trados Studio) while working on a translation assignment in groups.

source: In diesen erhalten die Studierenden umfassenden Einblick in für die Übersetzung relevante Bereiche der Sprachtechnologie.
en_gb: The students gain a comprehensive insight into areas of language technology relating to translation.

source: In Phase 3 lernen die Studierenden weitere Anwendungen der Sprachtechnologie (Korpora) kennen, die sie bei ihrer Arbeit unterstützen können.
en_gb: In Phase 3, the students gain familiarity with further applications in language technology that can aid them in their work (corpora).

source: In Phase 4 wenden die Studierenden die bis dahin erworbenen Kenntnisse auf eine neue Software Anwendung an und nutzen dabei die in den vorherigen Phasen erarbeiteten Materialien.
en_gb: In Phase 4, the students apply their acquired knowledge and skills on a new software application, using the material from the previous phases.

source: Dabei werden im Kurs die folgenden Ziele verfolgt:
en_gb: The aims of the course are:

source: Erwerb erweiterter Kenntnisse im Bereich Sprachtechnologie auch für Teilnehmende ohne Vorkenntnisse
en_gb: to give students, including those without any prior experience, advanced skills in language technologies

source: Input von Dozierenden und externen Experten, begleitete Übungen, Gruppenarbeiten.
en_gb: Input from faculty members and external experts, accompanied exercises, group work.

source: Konzept Vertiefung FÜ ab FS 2016:
en_gb: Concept for Specialisation in Professional Translation from FS 2016:

source: Theorie und Praxis des Übersetzens (Modul und Kurs)
en_gb: Translation Theory and Practice (module and course)

source: Provisorische Kursbeschreibung
en_gb: Provisional course description

source: Befähigung zur kritischen Auseinandersetzung mit wissenschaftlicher Literatur
en_gb: Students are able to critically read and discuss academic literature

source: Befähigung zur Anwendung der behandelten Theorien und Methoden auf die eigene übersetzerische Arbeit
en_gb: Students are able to apply the theories and methods discussed to their own translation work

source: Die theoretischen Texte und Artikel werden durch Beispiele und Übungen illustriert und vertieft.
en_gb: Examples and exercises are used to illustrate theoretical texts and articles.

source: Gruppenpräsentation Bewertungsart: bestanden / nicht bestanden
en_gb: Group presentation Assessment: pass or fail.

source: Bewertungsart: bestanden / nicht bestanden
en_gb: Assessment: pass or fail.

source: Deutsch und/oder Englisch im Plenum
en_gb: German and/or English in a group situation

source: Pflichtlektüre und weiterführende Literatur werden zu Beginn des Semesters bekannt gegeben.
en_gb: Compulsory reading list and further reading will be announced at the beginning of the semester.

source: Vertiefung des übersetzungstheoretischen und methodischen Grundlagenwissens
en_gb: Students gain greater insight into the theoretical and methodological aspects of translation
